//для обчислення даних, необхідних для реалізації пагінації на стороні сервера
export const calculatePaginationData = (count, perPage, page) => {
  const totalPages = Math.ceil(count / perPage); //обчислення загальної кількості сторінок, до найближчого більшого цілого числа
  const hasNextPage = Boolean(totalPages - page); //перевірка наявності наступної сторінки
  const hasPreviousPage = page !== 1; //перевірка наявності попередньої сторінки

  return {//повернення об'єкта з даними пагінації
    page, //номер поточної сторінки
    perPage, //кількість елементів на одну сторінку
    totalItems: count, //загальна кількість елементів
    totalPages, //загальна кількість сторінок
    hasPreviousPage, //булеве значення, що вказує на наявність попередньої сторінки
    hasNextPage, //булеве значення, що вказує на наявність наступної сторінки
  };
};
